
let city=["Москва","Санкт-Петербург","Новосибирск","Екатеринбург","Казань","Нижний Новгород","Челябинск","Красноярск","Самара","Уфа","Ростов-на-Дону","Омск","Краснодар","Воронеж","Пермь","Волгоград","Саратов","Тюмень","Тольятти","Барнаул","Ижевск","Махачкала","Хабаровск","Ульяновск","Иркутск","Владивосток","Ярославль","Кемерово","Томск","Набережные Челны","Севастополь","Ставрополь","Оренбург","Новокузнецк","Рязань","Балашиха","Пенза","Чебоксары","Липецк","Калининград","Астрахань","Тула","Киров","Сочи","Курск","Улан-Удэ","Тверь","Магнитогорск","Сургут","Брянск","Иваново","Якутск","Владимир","Симферополь","Белгород","Нижний Тагил","Калуга","Чита","Грозный","Волжский","Смоленск","Подольск","Саранск","Вологда","Курган","Череповец","Орёл","Архангельск","Владикавказ","Нижневартовск","Йошкар-Ола","Стерлитамак","Мурманск","Кострома","Новороссийск","Тамбов","Химки","Мытищи","Нальчик","Таганрог","Нижнекамск","Благовещенск","Комсомольск-на-Амуре","Петрозаводск","Королёв","Шахты","Энгельс","Великий Новгород","Люберцы","Братск","Старый Оскол","Ангарск","Сыктывкар","Дзержинск","Псков","Орск","Красногорск","Армавир","Абакан","Балаково","Бийск","Южно-Сахалинск","Одинцово","Уссурийск","Прокопьевск","Рыбинск","Норильск","Волгодонск","Сызрань","Петропавловск-Камчатский","Каменск-Уральский","Новочеркасск","Альметьевск","Златоуст","Северодвинск","Хасавюрт","Керчь","Домодедово","Салават","Миасс","Копейск","Пятигорск","Электросталь","Майкоп","Находка","Березники","Коломна","Щёлково","Серпухов","Ковров","Нефтекамск","Кисловодск","Батайск","Рубцовск","Обнинск","Кызыл","Дербент","Нефтеюганск","Назрань","Каспийск","Долгопрудный","Новочебоксарск","Новомосковск","Ессентуки","Невинномысск","Октябрьский","Раменское","Первоуральск","Михайловск","Реутов","Черкесск","Жуковский","Димитровград","Пушкино","Артём","Камышин","Евпатория","Муром","Ханты-Мансийск","Новый Уренгой","Северск","Орехово-Зуево","Арзамас","Ногинск","Новошахтинск","Бердск","Элиста","Сергиев Посад","Видное","Ачинск","Тобольск","Ноябрьск",]


//data массив с городами или так же можно строку, param в false(по умолчанию) если надо вернуть массив в true если строку
function TranslitCityArr(data,param) {
    if(typeof data==="string" ){
        data=data.split(",");
    }
    function translit(word){
        let answer = '';
        let converter = {
            'а': 'a',    'б': 'b',    'в': 'v',    'г': 'g',    'д': 'd',
            'е': 'e',    'ё': 'e',    'ж': 'zh',   'з': 'z',    'и': 'i',
            'й': 'y',    'к': 'k',    'л': 'l',    'м': 'm',    'н': 'n',
            'о': 'o',    'п': 'p',    'р': 'r',    'с': 's',    'т': 't',
            'у': 'u',    'ф': 'f',    'х': 'h',    'ц': 'c',    'ч': 'ch',
            'ш': 'sh',   'щ': 'sch',  'ь': '',     'ы': 'y',    'ъ': '',
            'э': 'e',    'ю': 'yu',   'я': 'ya',

            'А': 'A',    'Б': 'B',    'В': 'V',    'Г': 'G',    'Д': 'D',
            'Е': 'E',    'Ё': 'E',    'Ж': 'Zh',   'З': 'Z',    'И': 'I',
            'Й': 'Y',    'К': 'K',    'Л': 'L',    'М': 'M',    'Н': 'N',
            'О': 'O',    'П': 'P',    'Р': 'R',    'С': 'S',    'Т': 'T',
            'У': 'U',    'Ф': 'F',    'Х': 'H',    'Ц': 'C',    'Ч': 'Ch',
            'Ш': 'Sh',   'Щ': 'Sch',  'Ь': '',     'Ы': 'Y',    'Ъ': '',
            'Э': 'E',    'Ю': 'Yu',   'Я': 'Ya'
        };

        for (var i = 0; i < word.length; ++i ) {
            if (converter[word[i]] === undefined){
                answer += word[i];
            } else {
                answer += converter[word[i]];
            }
        }

        return answer;
    }
    let resultArr=[];
    for(let i=0;i<data.length;i++){
        resultArr.push(translit(data[i]));
    }

    return param?resultArr:resultArr.join(",");

}


console.log(TranslitCityArr(city,true));

//todo что бы пиздато функцию вызывать надо экспорыт и импорты сделать
export default TranslitCityArr;